___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn

In [3]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [9]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [10]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [11]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [189]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

DataFrame Columns are just Series

In [190]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [13]:
df['new'] = df['W'] + df['Y']

In [17]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

** Removing Columns**

In [20]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [19]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [21]:
df.drop('new',axis=1,inplace=True)

In [24]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

Can also drop rows this way:

In [25]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

In [4]:
df.drop("E",axis=0,inplace=True)

In [5]:
df

          W         X         Y         Z
A  0.116528  1.611052  0.055096  0.519302
B -0.573257 -1.222765  1.270431  0.435804
C -0.205320  1.394579  1.204792 -1.843767
D  0.227058 -0.452590  0.116693 -0.572007

** Selecting Rows**

In [6]:
df.loc['A']

W    0.116528
X    1.611052
Y    0.055096
Z    0.519302
Name: A, dtype: float64

Or select based off of position instead of label

In [7]:
df.iloc[2]

W   -0.205320
X    1.394579
Y    1.204792
Z   -1.843767
Name: C, dtype: float64

** Selecting subset of rows and columns **

In [8]:
df.loc['B','Y']

1.270431153735589

In [9]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.116528  0.055096
B -0.573257  1.270431

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [10]:
df

          W         X         Y         Z
A  0.116528  1.611052  0.055096  0.519302
B -0.573257 -1.222765  1.270431  0.435804
C -0.205320  1.394579  1.204792 -1.843767
D  0.227058 -0.452590  0.116693 -0.572007

In [11]:
df>0

       W      X     Y      Z
A   True   True  True   True
B  False  False  True   True
C  False   True  True  False
D   True  False  True  False

In [12]:
df[df>0]

          W         X         Y         Z
A  0.116528  1.611052  0.055096  0.519302
B       NaN       NaN  1.270431  0.435804
C       NaN  1.394579  1.204792       NaN
D  0.227058       NaN  0.116693       NaN

In [13]:
df['W']>0

A     True
B    False
C    False
D     True
Name: W, dtype: bool

In [14]:
df[df['W']>0]

          W         X         Y         Z
A  0.116528  1.611052  0.055096  0.519302
D  0.227058 -0.452590  0.116693 -0.572007

In [15]:
df[df['W']>0]['Y']

A    0.055096
D    0.116693
Name: Y, dtype: float64

In [16]:
df[df['W']>0][['Y','X']]

          Y         X
A  0.055096  1.611052
D  0.116693 -0.452590

For two conditions you can use | and & with parenthesis:

In [17]:
df[(df['W']>0) & (df['Y'] > -2.8)]

          W         X         Y         Z
A  0.116528  1.611052  0.055096  0.519302
D  0.227058 -0.452590  0.116693 -0.572007

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [18]:
df

          W         X         Y         Z
A  0.116528  1.611052  0.055096  0.519302
B -0.573257 -1.222765  1.270431  0.435804
C -0.205320  1.394579  1.204792 -1.843767
D  0.227058 -0.452590  0.116693 -0.572007

In [19]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A  0.116528  1.611052  0.055096  0.519302
1     B -0.573257 -1.222765  1.270431  0.435804
2     C -0.205320  1.394579  1.204792 -1.843767
3     D  0.227058 -0.452590  0.116693 -0.572007

In [21]:
newind = 'CA NY WY OR'.split()

In [22]:
df['States'] = newind

In [66]:
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR

In [67]:
df.set_index('States')

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752

In [23]:
df

          W         X         Y         Z States
A  0.116528  1.611052  0.055096  0.519302     CA
B -0.573257 -1.222765  1.270431  0.435804     NY
C -0.205320  1.394579  1.204792 -1.843767     WY
D  0.227058 -0.452590  0.116693 -0.572007     OR

In [69]:
df.set_index('States',inplace=True)

In [70]:
df

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [39]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = ['i','ii','iii','i','ii','iii']
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [40]:
hier_index

MultiIndex([('G1',   'i'),
            ('G1',  'ii'),
            ('G1', 'iii'),
            ('G2',   'i'),
            ('G2',  'ii'),
            ('G2', 'iii')],
           )

In [41]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

               A         B
G1 i    1.009197 -0.824910
   ii   0.471432 -2.450328
   iii -1.257539 -0.345952
G2 i    0.051426 -0.468578
   ii   0.424790 -0.675237
   iii  1.336146 -0.048041

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

Note:-

loc gets rows (or columns) with particular labels from the index.
iloc gets rows (or columns) at particular positions in the index (so it only takes integers).

In [53]:
df.loc['G1']

                 A         B
Numerals
i         1.009197 -0.824910
ii        0.471432 -2.450328
iii      -1.257539 -0.345952

In [44]:
df.loc['G1'].loc['i']

A    1.009197
B   -0.824910
Name: i, dtype: float64

In [31]:
df.index.names

FrozenList([None, None])

In [45]:
df.index.names = ['Group','Numerals']

In [54]:
df['A']

Group  Numerals
G1     i           1.009197
       ii          0.471432
       iii        -1.257539
G2     i           0.051426
       ii          0.424790
       iii         1.336146
Name: A, dtype: float64

In [270]:
df.xs('G1')

            A         B
Num
1    0.153661  0.167638
2   -0.765930  0.962299
3    0.902826 -0.537909

In [271]:
df.xs(['G1',1])

A    0.153661
B    0.167638
Name: (G1, 1), dtype: float64

In [273]:
df.xs(1,level='Num')

              A         B
Group
G1     0.153661  0.167638
G2    -1.549671  0.435253

# Great Job!